app/Controllers/IntegrantesController.php

SELECT *
FROM `integrantes`
---
    public function verIntegrantes(): string
    {
        $integrantes = new IntegrantesModel();
        $datos['datos']=$integrantes->findAll();

INSERT INTO `integrantes` (`nombre`, `apellido`, `fecha_nacimiento`, `fecha_muerte`, `web_oficial`, `pais_nacimiento`) VALUES ('Ricardo', 'Arjona', '1964-01-19', '', 'https://ricardoarjona.com', 'Guatemala')
---
    public function guardarIntegrante()
    {
        $integrantes = new IntegrantesModel();
        $datos = [
            'integrante_id' => $this->request->getPost('txtIntID'),
            'nombre' => $this->request->getPost('txtNombre'),
            'apellido' => $this->request->getPost('txtApellido'),
            'fecha_nacimiento' => $this->request->getPost('txtFechaNac'),
            'fecha_muerte' => $this->request->getPost('txtFechaMuerte'),
            'web_oficial' => $this->request->getPost('txtWeb'),
            'pais_nacimiento' => $this->request->getPost('txtPais')
        ];
        print_r($datos);
        $integrantes->insert($datos);

SELECT *
FROM `integrantes`
WHERE `integrante_id` = '14'
 LIMIT 1
---
    public function actualizarIntegrante($cod=null)
    {
        $integrantes = new IntegrantesModel();
        $datos['datos']=$integrantes->where(['integrante_id'=>$cod])->first();